/*
                             *******************
******************************* C SOURCE FILE ********************************
**                           *******************                            **
**                                                                          **
**  Project   : E100_LDC                                                    **
**  Filename  : Rte_Utils.c                                                 **
**  Version   : -.- (PCB : )                                                **
**  Date      : 2019.09.05                                                  **
**                                                                          **
******************************************************************************
**                                                                          **
**  (c) 2019 YOUNG HWA TECH Co., Ltd. All Rights Reserved                   **
**                                                                          **
**                       YOUNG HWA TECH Co., Ltd.                           **
******************************************************************************

VERSION HISTORY:
----------------

Version     : -.-
Date        : ----.--.--
Revised by  : Im, Hong Kyun
Description : Original version.

*/

#define RTE_UTILS_C_SRC

/****************************************************************************/
/**                                                                        **/
/**                      MODULES USED                                      **/
/**                                                                        **/
/****************************************************************************/
#include "Rte_Utils.h"

/****************************************************************************/
/**                                                                        **/
/**                      DEFINITIONS AND MACROS                            **/
/**                                                                        **/
/****************************************************************************/

/****************************************************************************/
/**                                                                        **/
/**                      TYPEDEFS AND STRUCTURES                           **/
/**                                                                        **/
/****************************************************************************/

/****************************************************************************/
/**                                                                        **/
/**                      PROTOTYPES OF LOCAL FUNCTIONS                     **/
/**                                                                        **/
/****************************************************************************/

/****************************************************************************/
/**                                                                        **/
/**                      EXPORTED VARIABLES                                **/
/**                                                                        **/
/****************************************************************************/

/****************************************************************************/
/**                                                                        **/
/**                      GLOBAL VARIABLES                                  **/
/**                                                                        **/
/****************************************************************************/

/****************************************************************************/
/**                                                                        **/
/**                      EXPORTED FUNCTIONS                                **/
/**                                                                        **/
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/* Function  |                                                              */
/* Name      |                                                              */
/*--------------------------------------------------------------------------*/
/* Parameter | Nothing                                                      */
/* Return    | Nothing                                                      */
/*--------------------------------------------------------------------------*/
void utils_memcpy( void *des, const void *src, uint32_t num )
{
	char* pDes = ( char* )des; /* [CS_IGNORE=MISRA_C_2012.MISRA_C_2012_11_05;char, signed char, unsigned char를 가리키는 포인터 간의 변환은 허용된다. 이 타입들이 독립된 byte단위로 접근할수 있게끔 표준이 보장하기 때문이다. (근거 - Rule 11.3)] */
	const char* pSrc = ( const char* )src; /* [CS_IGNORE=MISRA_C_2012.MISRA_C_2012_11_08;char, signed char, unsigned char를 가리키는 포인터 간의 변환은 허용된다. 이 타입들이 독립된 byte단위로 접근할수 있게끔 표준이 보장하기 때문이다. (근거 - Rule 11.3)] */ /* [CS_IGNORE=MISRA_C_2012.MISRA_C_2012_11_05;char, signed char, unsigned char를 가리키는 포인터 간의 변환은 허용된다. 이 타입들이 독립된 byte단위로 접근할수 있게끔 표준이 보장하기 때문이다. (근거 - Rule 11.3)] */

	uint32_t idx = 0;

	for( idx = 0 ; idx < num ; idx++ )
	{
		pDes[ idx ] = pSrc[ idx ];
	}
}

/*--------------------------------------------------------------------------*/
/* Function  |                                                              */
/* Name      |                                                              */
/*--------------------------------------------------------------------------*/
/* Parameter | Nothing                                                      */
/* Return    | Nothing                                                      */
/*--------------------------------------------------------------------------*/
uint16_t UTILS_IIN_INV( uint16_t AverAdc_Iin )
{
	uint32_t Iinmax;
	uint16_t iin;

	if( AverAdc_Iin < 257 )
	{
		Iinmax = 390U;
	}
	else if ( ( AverAdc_Iin >=257 ) && ( AverAdc_Iin < 322 ) )
	{
		Iinmax = 390U;
	}
	else if ( AverAdc_Iin >= 322 )
	{
		Iinmax = 380U;
	}
	else
	{
		/* exception */
	}

	iin = ( uint16_t )( ( AverAdc_Iin * Iinmax ) / 4096U );

	return iin;
}

/*--------------------------------------------------------------------------*/
/* Function  |                                                              */
/* Name      |                                                              */
/*--------------------------------------------------------------------------*/
/* Parameter | Nothing                                                      */
/* Return    | Nothing                                                      */
/*--------------------------------------------------------------------------*/
int16_t UTILS_TEMP_INV( int16_t AverAdc_Temp )
{
	int16_t temp = 0;

	if( AverAdc_Temp >= 3670 )
	{
		temp = -( ( ( AverAdc_Temp - 3670 ) * 10U ) / 120 ) - 15;
	}
	else if( ( AverAdc_Temp >= 3186 ) && ( AverAdc_Temp < 3670 ) )
	{
		temp = 7 - ( ( ( AverAdc_Temp - 3186 ) * 10 ) / 222 );
	}
	else if( ( AverAdc_Temp >= 2510 ) && ( AverAdc_Temp < 3186 ) )
	{
		temp = 26 - ( ( ( AverAdc_Temp - 2510 ) * 10 ) / 355 );
	}
	else if( ( AverAdc_Temp >= 1368 ) && ( AverAdc_Temp < 2510 ) )
	{
		temp = 60 - ( ( AverAdc_Temp - 1368 ) / 33 );
	}
	else if( ( AverAdc_Temp >= 942 ) && ( AverAdc_Temp < 1368 ) )
	{
		temp = 77 - ( ( AverAdc_Temp - 942 ) / 29 );
	}
	else if( ( AverAdc_Temp >= 704 ) && ( AverAdc_Temp < 942 ) )
	{
		temp = 90 - ( ( AverAdc_Temp - 704 ) / 19 );
	}
	else if( ( AverAdc_Temp >= 542 ) && ( AverAdc_Temp < 704 ) )
	{
		temp = 103 - ( ( AverAdc_Temp - 542 ) / 14 );
	}
	else if( ( AverAdc_Temp >= 348 ) && ( AverAdc_Temp < 542 ) )
	{
		temp = 120 - ( ( ( AverAdc_Temp - 348 ) * 10 ) / 103 );
	}
	else if( ( AverAdc_Temp >= 204 ) && ( AverAdc_Temp < 348 ) )
	{
		temp = 145 - ( ( ( AverAdc_Temp - 204 ) * 10 ) / 96 );
	}
	else
	{
		temp = 145 + ( ( ( 204 - AverAdc_Temp ) * 10 ) / 28 );
	}

	return temp;
}

/****************************************************************************/
/**                                                                        **/
/**                      LOCAL FUNCTIONS                                   **/
/**                                                                        **/
/****************************************************************************/

/****************************************************************************/
/**                                                                        **/
/**                      EOF                                               **/
/**                                                                        **/
/****************************************************************************/
