/* -----------------------------------------------------------------------------
  Filename:    desc.c
  Description: Implementation of CANdesc.
                
                Manufacturer: SYMC
                EcuDocFile:   D:\07_Working\E100\source\Geny\Cdd\SYMC_E100_LDC_UDS.cdd
                Variant:      CommonDiagnostics

  Generated by CANdelaGen, Wed Apr 08 09:35:36 2020
 
 ----------------------------------------------------------------------------- */
/* -----------------------------------------------------------------------------
  C O P Y R I G H T
 -------------------------------------------------------------------------------
  Copyright (c) 2001-2013 by Vector Informatik GmbH. All rights reserved.
 
  This software is copyright protected and proprietary to Vector Informatik 
  GmbH.
  
  Vector Informatik GmbH grants to you only those rights as set out in the 
  license conditions.
  
  All other rights remain with Vector Informatik GmbH.
 -------------------------------------------------------------------------------
 ----------------------------------------------------------------------------- */

/* -----------------------------------------------------------------------------
    &&&~ Includes
 ----------------------------------------------------------------------------- */

/* Physical layer specific API */
#include "v_inc.h"
/* -- V_NULL Definition -- */
#if !defined(V_NULL)
# define V_NULL                                                      0
#endif


# define kDescOemNrcParamIdNotSupportedInSession                     kDescNrcRequestOutOfRange
#endif

#if !defined (kDescOemNrcParamIdNotSupportedInSecurityState)
# define kDescOemNrcParamIdNotSupportedInSecurityState               kDescNrcAccessDenied
#endif


/*  Length of negative response message */
#define kDescNegResLen                                               ((DescMsgLen)3)
/*  Positive response service ID offset */
#define kDescPosResIdOffset                                          ((vuint8)0x40)

#define kDescNumPostHandlers                                         3
/* Stores the reference of the SvcInstTable entry for the service which stops sessions (starts default session). */
#define kDescDefaultSessionSvcInstEntry                              0
/* No NRCs additionally suppressed */
#define DESC_ADD_SUPPRESSED_FUNC_NRC                                 case 0x7f: case 0x7e:

/* The first entry of the SessionControl service is to be found at this position (g_descSvcHead table). */
#define kDescSvcHeadOffsetSDS                                        0
/* The first entry of the SessionControl service is to be found at this position (g_descSvcInst table). */
#define kDescSvcInstOffsetSDS                                        0
/* No NRCs additionally suppressed */
#define DESC_OEM_SUPPRESSED_FUNC_NRC                                 /* Fall through */

/* Security access seed length */
#define kDescSecurityAccessSeedLength                                (vuint8) 8
/* Security access seed maximum length */
#define kDescSecurityAccessMaxSeedLength                             (vuint8) 8
/* Security access key length */
#define kDescSecurityAccessKeyLength                                 (vuint8) 4

/* Must not be greater 255 since a byte counter is used */
/* todo: check this setting in the generator!!!*/

#define kDescNumPids                                                 8
/* Invalid handle after PID lookup */
#define kDescInvalidPidHandle                                        ((DescMemPidInstIndex)kDescNumPids)

/* Multiple PIDs processing specific NRC on too long response. */
#define kDescOemNrcResponseTooLong                                   kDescNrcResponseTooLong
/* Multiple PIDs processing specific NRC on too many PID in single request. */
#define kDescOemNrcTooManyPIDs                                       kDescNrcInvalidFormat
/* Precalculated bit field length (in bytes)*/
#define kDescNumPostHdlrQueueBytes                                   (((kDescNumMaxPidList - 1)/ 8) + 1)
#if defined(DESC_ENABLE_UNIFIED_PID_MGR)
/* Do not hide the PID */
# define kDescReservedBytesForPid                                    0
#else
/* Do hide the PID */
# define kDescReservedBytesForPid                                    2
#endif



/* -----------------------------------------------------------------------------
    &&&~ Datatype definitions
 ----------------------------------------------------------------------------- */

/*-- TP information types  --*/
#if defined (DESC_ENABLE_BUSY_REPEAT_RESPONDER)
typedef struct
{
  vuint8 resBuffer[3];
  vuint8 tpRxChannel;
} DescAddResBuffer;

typedef union
{
  vuint8           reqBuffer[7];
  DescAddResBuffer res;
} DescAddBuffer;

typedef struct
{
  vuint8        status;
  DescAddBuffer buffers;
} DescAddChannel;

typedef struct
{
  vuint8         count;
  DescAddChannel channel[kDescNumAddRequestChannels];
} DescAddChannelCtrl;

#endif /* defined (DESC_ENABLE_BUSY_REPEAT_RESPONDER)*/

#if defined (DESC_ENABLE_BUSY_REPEAT_RESPONDER)
typedef struct
{
  DescBitType type:4;
  DescBitType info:4;
} DescTpMemberCtrl;

typedef struct
{
  DescTpMemberCtrl rxPath[kTpRxChannelCount];
  DescTpMemberCtrl txPath[kTpTxChannelCount];
} DescTpCtrl;
#endif /* defined (DESC_ENABLE_BUSY_REPEAT_RESPONDER) */

/* forward declaration of t_descUsdtNetInfoPool */
typedef struct t_descUsdtNetInfoPoolTag t_descUsdtNetInfoPool;
typedef struct t_descUsdtNetInfoPoolTag* t_descUsdtNetInfoPoolPtr;
/* Network dependent data type */
struct t_descUsdtNetInfoPoolTag
{
  t_descUsdtNetBus        busInfo;
  t_descUsdtNetReqType    reqType;
  t_descUsdtNetResType    resType;
  t_descUsdtNetBusHandle  busHandle;
  t_descHandle            descHandle;
  vuint16                 dataLength;

  DescUsdtNetMsg          reqDataPtr;
  DescUsdtNetMsg          resDataPtr;
};

/* ---- Context management state machine ---- */
typedef struct
{
  t_descUsdtNetResult txState;/* Tp ErrorCode */
  DescBitType         contextMode                :3;/* 0x00 - Normal, 0x01 - PIDListProcess */
  DescBitType         isApplError                :1;/* 0x00 - CANdesc NR, 0x01 - APPL NR */
  DescBitType         isSupplPost                :1;/* 0x00 - CANdesc NR, 0x01 - SUPPL NR */
  DescBitType         isSPRMIBOverridden         :1;/* 0x00 - SPRMIB is not overridden, 0x01 - SPRMIB is orverridden*/
  DescBitType         dummy                      :2;
} DescContextCtrl;

/* ---- Interrupt context management state machine ---- */
typedef struct
{
  t_descUsdtNetInfoPoolPtr infoPoolPtr;
  vuint8             activity                 ;/* 0x00 - Idle, 0x01 - ActiveRx, 0x02 - ActiveProcess, 0x04 - ActiveTxSingleResponse ,0x08 - ActiveTxPeriodicRes, 0x10 - ActiveTxRoeResponder */
#if defined (DESC_ENABLE_FORCE_RCR_RP)
  DescBitType        forcedRcrRpState       :2;/* 0x00 - Idle, 0x01 - Charged, 0x02 - WaitConfirmation */
#endif
#if defined(DESC_ENABLE_ALL_RES_AFTER_RCRRP)
  DescBitType        rcrRpSent              :1;/* 0x00 - not sent, 0x01 - sent */
#endif
  DescBitType        isContextLocked        :1;
} DescInterruptContextCtrl;

/* ---  Timer definitions with 8 Bit CPU optimization  --- */
/* Time T2: */
/* if at least 16 bit CPU - use always 16 bit variables */
/* Time S1: */
typedef vuint16 DescS1Timer;
/* Time T2: */
typedef vuint16 DescT2Timer;

#if defined (DESC_ENABLE_RES_PENDING_TIME_LIMIT) || defined (DESC_ENABLE_RES_PENDING_COUNT_LIMIT)
/* type definition for Response pending limit timer */
typedef vuint16 DescRcrrpLimitTimer;
#endif

typedef struct DescStateInfoTag
{
  DescStateGroup stateSession : 4;
  DescStateGroup stateSecurityAccess : 3;
  DescStateGroup stateGap_0 : 1;
} DescStateInfo;
#if (kDescStateGroupNumTransition > 255)
  typedef vuint16    DescSetStateIndex;
#else
  typedef vuint8     DescSetStateIndex;
#endif

typedef vuint8 DescSvcHeadIndex; /* Typedef for the SvcHead table indexes- 8/16Bit depeding on its size. */
typedef vuint8_least DescSvcInstIndex; /* Type definition for the SvcInstTable indexes, depending on the SvcInstTable size. */
typedef vuint8 DescMemSvcInstIndex; /* Type definition for the DescMemSvcInstIndex indexes, depending on the SvcInstTable size. */
typedef vuint8 DescPostHandlerIndex; /* Type definition for the Post-handler reference table, depending on its size. */
typedef vuint8_least DescSvcInstHeadExtIndex; /* Type definition for the SvcInstHeadExtTable indexes, depending on the SvcInstTable size. */
typedef vuint8 DescMemSvcInstHeadExtIndex; /* Type definition for the DescMemSvcInstHeadExtIndex indexes, depending on the SvcInstTable size. */
/* Application callbacks (main handler is already defiend in  the desc.h (because of MSCall)) */
typedef void DESC_API_CALL_TYPE (*DescPreHandler)      (DESC_CONTEXT_PARAM_TYPE_ONLY);
typedef void DESC_API_CALL_TYPE (*DescPostHandler)     (DESC_CONTEXT_PARAM_TYPE_FIRST vuint8);

typedef struct
{
  DescBitType                reqHeadByteSpec   :8; /* Each bit represents sub-function/identifier - 0: identifier; 1: any subfunction */
#if defined(DESC_ENABLE_SUB_SVC_USAGE)
  DescBitType                reqHeadExLen      :4; /* Request HeadEx length up to 7 Byte  */
  DescBitType                resHeadExLen      :4; /* Response HeadEx length up to 7 Byte */
#endif
#if defined (DESC_ENABLE_ADDR_METHOD_CHECK)
  DescBitType             reqType           :2; /* 0x01: Phys 0x02: Func */
  DescBitType             resOnReq          :2; /* 0x01: Phys 0x02: Func */
#endif
  DescBitType             suppPosRes        :1; /* 0x00: No   0x01: Yes  */
  DescBitType             isReqHeadExtEchoed:1; /* 0x00: No   0x01: Yes  */
  DescBitType             hasSubFunction    :1; /* 0x00: No   0x01: Yes  */
#if (kDescNumSvcHeadConstGapBits > 0)
  DescBitType             svcHeadPlaceHolder:kDescNumSvcHeadConstGapBits; /* Gap holder  */
#endif
#if defined (DESC_ENABLE_AUTO_STATES)
# if defined (DESC_ENABLE_ALL_STATEGROUPS_SID_CHECK)
  DescStateInfo           checkState;
# else
#  if (kDescNumStateSession > 0)
  DescStateGroup          checkSessionState :kDescNumStateSession;/* State group Session on SId level */
#   if (kDescNumSvcHeadSessionGapBits > 0)
  DescBitType             sessionPlaceHolder:kDescNumSvcHeadSessionGapBits; /* Gap holder  */
#   endif
#  endif
# endif
#endif
#if defined (DESC_ENABLE_MIN_REQ_LEN_CHECK) && \
    defined (DESC_ENABLE_SUB_SVC_USAGE)
  vuint8                  minReqLength;
#endif
#if defined (DESC_ENABLE_MULTI_VARIANT)
  DescVariantMask         variantMask;
#endif
/* First item in Service Instance table */
  DescMemSvcInstIndex        svcInstFirstItem;
